{
  "jobs": [
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "Marketing Lead (founding role) ",
      "job_category": "marketing_leadership",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\">Fitt Talent Partners is a specialized recruitment firm working with top health and wellness companies.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We’re filling this role for a client, a personalized supplement service that blends genetic, lab, and lifestyle data to deliver custom capsule protocols.</p><p style=\"min-height:1.5em\"></p><h2><strong>Job Description</strong></h2><p style=\"min-height:1.5em\">We are hiring our founding marketing leader.There is no big team. There is no playbook. You are here to build the marketing engine from scratch, move the ball forward every day, and help turn early traction into repeatable growth and Series A readiness. You will have real autonomy, real ownership, and daily collaboration with the founders.</p><p style=\"min-height:1.5em\"></p><h2><strong>Responsibilities</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Identify and validate 1–2 high-leverage acquisition channels with clear path to scale</p></li><li><p style=\"min-height:1.5em\">Test quickly, measure honestly, and double down on what works (cut what doesn’t)</p></li><li><p style=\"min-height:1.5em\">Own CAC, conversion rates, and marketing efficiency with a relentless focus on ROI</p></li><li><p style=\"min-height:1.5em\">Build and execute a full-funnel growth strategy from first touch through conversion</p></li><li><p style=\"min-height:1.5em\">Design and optimize end-to-end customer journeys across paid, owned, and product surfaces</p></li><li><p style=\"min-height:1.5em\">Define and own brand positioning, messaging, and conversion-focused copy</p></li><li><p style=\"min-height:1.5em\">Translate complex health data into clear, trust-building customer communication</p></li><li><p style=\"min-height:1.5em\">Establish lifecycle systems that drive retention and long-term value</p></li><li><p style=\"min-height:1.5em\">Manage agencies and contractors while remaining hands-on in execution</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Qualifications</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have built or been apart of building marketing from zero before. You are comfortable without structure and good at creating it. You do not need permission to execute.</p></li><li><p style=\"min-height:1.5em\">You have experience in health, wellness, supplements, digital health, or consumer subscription businesses. You understand trust-based, education driven funnels.</p></li><li><p style=\"min-height:1.5em\">You bring a real network with you. This includes relationships within the industry, as well as a bench of contractors and freelancers you already know and trust to do high quality work when needed.</p></li><li><p style=\"min-height:1.5em\">You are technically proficient with relevant platforms such as Shopify, Meta Ads, Google Ads, Klaviyo, Google Analytics, and creative tools like Canva and Figma.</p></li><li><p style=\"min-height:1.5em\">You want ownership, not comfort. You care about results more than titles and thrive in high accountability, results driven environments.</p></li></ul>",
      "job_url": "https://jobs.ashbyhq.com/fitt/61870e1f-b1c1-4f27-9a90-f59570bf5ad9",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 100.0,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "Vice President of Marketing",
      "job_category": "general_marketing",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\"><strong>Fitt Talent Partners is a specialized recruitment firm for top health and wellness companies.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>We’re filling this role for a client, a regenerative and preventive medicine leader using AI biomarker analysis and telemedicine to deliver personalized care for optimal, long-term health. </strong></p><p style=\"min-height:1.5em\"></p><h2>Job Description</h2><p style=\"min-height:1.5em\">We are seeking a bold and disruptive, results-driven Vice President (VP) of Marketing to accelerate our growth by owning the marketing strategy across multiple product verticals developing and executing marketing plans across multiple communication vehicles including owning creative and measurement. This leader will shape the marketing vision while rolling up their sleeves to execute high-impact initiatives across brand, growth and new market expansion.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This role is ideal for a strategic, forward-thinking marketing executive who thrives in a fast-paced environment scaling a mission driven functional health brand.</p><p style=\"min-height:1.5em\"></p><h2><strong>Responsibilities</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Own and lead the overall marketing and brand strategies </strong>including determining how, where and when the brand will grow to establish a strong, trusted patient experience.</p></li><li><p style=\"min-height:1.5em\"><strong>Establish marketing frameworks/ processes </strong>and develop a high-performance marketing team to scale growth.</p></li><li><p style=\"min-height:1.5em\"><strong>Drive growth across DTC channels</strong>, including developing and executing the eCommerce, paid and organic media strategies.</p></li><li><p style=\"min-height:1.5em\"><strong>Build and manage the marketing budget</strong>, forecasting key growth metrics and optimizing ROI across spend categories.</p></li><li><p style=\"min-height:1.5em\"><strong>Lead measurement and analytics including data-driven experimentation (A/B testing)</strong> to refine pricing, campaigns, funnels, and messaging.</p></li><li><p style=\"min-height:1.5em\"><strong>Conduct deep market and competitive analysis</strong> to uncover new opportunities and inform new vertical launches.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate with cross-functional partners i</strong>ncluding Operations, Clinical, Product and Technology teams to ensure a cohesive consumer experience.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Requirements</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">10+ years of progressive marketing experience, including leadership roles in DTC or health, wellness, or consumer technology sectors.</p></li><li><p style=\"min-height:1.5em\">Proven success building and executing growth strategies in a fast-scaling or disruptive company.</p></li><li><p style=\"min-height:1.5em\">Experience launching new verticals or product lines.</p></li><li><p style=\"min-height:1.5em\">Demonstrated experience with influencer, podcast, or partnership marketing with measurable growth impact.</p></li><li><p style=\"min-height:1.5em\">Budget ownership experience, including performance accountability.</p></li><li><p style=\"min-height:1.5em\">Expert in digital acquisition channels and performance metrics (social, paid search, email, retention).</p></li><li><p style=\"min-height:1.5em\">Hands-on operator comfortable both leading strategy and executing directly with a small team.</p></li><li><p style=\"min-height:1.5em\">Strong analytical mindset with a bias for experimentation, testing, and iteration.</p></li><li><p style=\"min-height:1.5em\">Exceptional communication and leadership skills—able to inspire teams and align stakeholders around a growth vision.</p></li></ul>",
      "job_url": "https://jobs.ashbyhq.com/fitt/49181dcb-66ad-47ed-8079-5f0d2ab6bb85",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 100.0,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "Vice President of Marketing",
      "job_category": "general_marketing",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\">Fitt Talent Partners is a specialized recruitment firm working with top health and wellness companies.</p><p style=\"min-height:1.5em\">We’re filling this role for a client, A venture-backed healthtech company using a targeted, clinically validated spectrum of UVB light to safely boost natural vitamin D production — addressing deficiency without the risks of sun exposure.</p><p style=\"min-height:1.5em\"></p><h2><strong>Job Description </strong></h2><p style=\"min-height:1.5em\">We’re building a category-defining consumer health brand powered by clinical science and premium hardware. As VP of Marketing, you’ll lead the charge — owning brand, growth, and GTM strategy across DTC and B2B channels. This is a highly strategic, hands-on leadership role with full accountability for pipeline, revenue, and brand equity.</p><p style=\"min-height:1.5em\"></p><h2>Responsibilities </h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Own the brand</strong>: Define positioning, architecture, and messaging that blend medical credibility with lifestyle appeal — launching a new category in precision light therapy.</p></li><li><p style=\"min-height:1.5em\"><strong>Build the team</strong>: Hire and lead a cross-functional marketing org spanning brand, growth, content, lifecycle, product marketing, and ops.</p></li><li><p style=\"min-height:1.5em\"><strong>Drive GTM</strong>: Develop multi-channel go-to-market strategies across new products and markets — pricing, channel mix, launch planning, and sales enablement.</p></li><li><p style=\"min-height:1.5em\"><strong>Scale DTC growth</strong>: Manage the full funnel — from paid acquisition and CRO to retention and subscription revenue optimization.</p></li><li><p style=\"min-height:1.5em\"><strong>Translate the science</strong>: Turn complex biology and clinical data into clear, compliant messaging for consumers, clinicians, and partners.</p></li><li><p style=\"min-height:1.5em\"><strong>Support B2B growth</strong>: Lead marketing efforts for clinics, wellness centers, and partners — from demand gen to co-marketing and sales tools.</p></li><li><p style=\"min-height:1.5em\"><strong>Measure what matters</strong>: Set KPIs, build dashboards, and tie brand + demand to real business outcomes.</p></li><li><p style=\"min-height:1.5em\"><strong>Partner across functions</strong>: Work closely with clinical, legal, and regulatory to ensure all claims and communications meet standards.</p></li><li><p style=\"min-height:1.5em\"><strong>Operate like an owner</strong>: Manage budgets, select external partners, and help shape company-wide strategy as a member of the executive team.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>What You Bring</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">10–15+ years in marketing leadership roles, ideally across healthtech, medtech, or high-engagement wellness.</p></li><li><p style=\"min-height:1.5em\">Experience launching regulated medical devices or premium health hardware in consumer channels.</p></li><li><p style=\"min-height:1.5em\">Proven track record growing DTC businesses — including performance marketing, retention, subscriptions, and LTV optimization.</p></li><li><p style=\"min-height:1.5em\">Strong grasp of health claims, compliance, and working with clinical + regulatory teams.</p></li><li><p style=\"min-height:1.5em\">Sharp storytelling instincts and ability to turn complex science into clear narratives for diverse audiences.</p></li><li><p style=\"min-height:1.5em\">A data-driven, experiment-minded approach to growth.</p></li><li><p style=\"min-height:1.5em\">High standards, high integrity, and a mission-driven mindset focused on improving lives.</p></li></ul>",
      "job_url": "https://jobs.ashbyhq.com/fitt/4a848cc9-bb78-4bee-9599-9783c36af5f2",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 100.0,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "Director of Paid Media ",
      "job_category": "performance_marketing",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\">Fitt Talent Partners is a specialized recruitment firm working with top health and wellness companies.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We’re filling this role for a client, a sports nutrition company.</p><p style=\"min-height:1.5em\"></p><h2><strong>Job Description</strong></h2><p style=\"min-height:1.5em\">We’re looking for a remote Director of Paid Media to own the end-to-end paid media strategy that fuels our growth. This is a high-impact role leading a<strong> </strong>7-figure monthly ad spend with precision, where you’ll be responsible for scaling new customer acquisition, unlocking new funnels, and driving world-class creative performance. If you thrive at the intersection of strategy, analytics, and creativity, this is your chance to make a massive impact.</p><p style=\"min-height:1.5em\"></p><h2><strong>Responsibilities</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Budget Forecast and Management</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Forecast budget allocation per channel and funnel based on efficiency targets and scale goals.</p></li><li><p style=\"min-height:1.5em\">Manage and adjust budgets daily to guarantee maximum ROI and efficient spend allocation.</p></li><li><p style=\"min-height:1.5em\">Collaborate with Inventory Planning to ensure product availability aligns with scaling objectives.</p></li><li><p style=\"min-height:1.5em\">Monitor margins, CAC, and LTV metrics to recalibrate spend and capture emerging market opportunities.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Paid Media Channel Ownership &amp; Optimization</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Take full ownership of performance across Meta Ads, Google Ads, and emerging paid channels.</p></li><li><p style=\"min-height:1.5em\">Execute daily campaign management and optimization using a refined SOP with clear rules for creative testing, scaling, and performance metrics.</p></li><li><p style=\"min-height:1.5em\">Lead a structured testing program across platforms, evolving strategies based on platform changes and algorithm shifts.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Creative Performance Leadership</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own the weekly performance analysis for the creative testing framework, aimed at finding new winners and scalable angles.</p></li><li><p style=\"min-height:1.5em\">Provide weekly &amp; monthly creative insights that reveal platform patterns, consumer behaviors, and opportunities to increase CR and reduce CAC.</p></li><li><p style=\"min-height:1.5em\">Lead Creative Strategists to drive data-backed creative iterations, leveraging direct response principles and consumer psychology.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Funnel Performance Analysis</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Continuously assess funnels using key variables such as attribution windows, new visitor percentage, and audience rollover to optimize targets.</p></li><li><p style=\"min-height:1.5em\">Identify and exploit scaling advantages (e.g., whitelisting, URLs, formats, placements).</p></li><li><p style=\"min-height:1.5em\">Collaborate with CRO to design and deploy A/B tests improving core metrics: Margin, CAC, Subscription Rate, PpV, and AOV.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Process &amp; System Development</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design and document cross-functional workflows linking creative, forecasting, and unit economics for acquisition goals.</p></li><li><p style=\"min-height:1.5em\">Maintain up to date SOPs for all creative and media buying processes, including optimization rules, scaling protocols, and campaign setup.</p></li><li><p style=\"min-height:1.5em\">Implement continuous process improvement to ensure speed, scalability, and quality in execution.</p></li></ul></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>What You Bring</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">7+ years of experience in Paid Media, with proven success in scaling DTC brands.</p></li><li><p style=\"min-height:1.5em\">Deep expertise in Meta Ads and Google Ads; familiarity with TikTok and emerging platforms is a plus.</p></li><li><p style=\"min-height:1.5em\">Strong analytical skills with experience managing budgets at $1M+/month.</p></li><li><p style=\"min-height:1.5em\">Proven track record of unlocking and scaling new acquisition funnels.</p></li><li><p style=\"min-height:1.5em\">Experience leading creative strategy, testing frameworks, and performance optimization.</p></li></ul>",
      "job_url": "https://jobs.ashbyhq.com/fitt/853423b2-9a21-45f3-9898-ea43e6600384",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 100.0,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "Senior Manager of Retention",
      "job_category": "lifecycle_crm",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\"><strong>Fitt Talent Partners is a specialized recruitment firm for top health and wellness companies.</strong></p><p style=\"min-height:1.5em\"><strong>We’re filling this role for a client, A real-food nutrition company focused on regeneratively raised meat snacks and supplements, crafted to make eating like a human easy, honest, and impactful.</strong></p><p style=\"min-height:1.5em\"></p><h2><strong>Job Description</strong></h2><p style=\"min-height:1.5em\">We’re hiring a <strong>Senior Manager of Retention</strong> to own the full customer lifecycle, from first purchase through long-term loyalty, across <strong>email, SMS, subscriptions, direct mail, post-purchase flows, winbacks</strong>, and beyond.</p><p style=\"min-height:1.5em\">We're not even two years old, yet our owned channels are scaling at a rate rarely seen in CPG:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>$20M+ in revenue driven from email + SMS</strong></p></li><li><p style=\"min-height:1.5em\"><strong>Nearly $1M in MRR from subscriptions</strong>, launched earlier this year</p></li></ul><p style=\"min-height:1.5em\">We are only getting started.</p><p style=\"min-height:1.5em\"><strong>Your mandate:</strong> grow our email list to <em>1 million engaged and passionate real-food subscribers</em>, and scale our subscription program into one of the strongest in the category.</p><p style=\"min-height:1.5em\">This role is both <strong>strategic and operational</strong>. You will work closely with our <strong>Director of Marketing</strong> and <strong>Director of Growth</strong> to develop the lifecycle roadmap, performance targets, campaign calendar, and experimentation plan for retention.</p><p style=\"min-height:1.5em\">At the same time, you're not afraid to get hands-on: building tests, constructing segmentation logic, optimizing flows, pulling data, QA’ing campaigns, and jumping in alongside a Designer, and Email Coordinator or Executive Assistant whenever needed.</p><p style=\"min-height:1.5em\">You should <strong>live and breathe Klaviyo</strong>, understand retention levers like LTV, churn signals, CAC:LTV, and cohort behavior, and thrive in an environment where we create hypotheses, test them, review learnings, and operationalize quickly.</p><h2></h2><h2><strong>Responsibilities</strong></h2><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Email, SMS &amp; Direct Mail</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own Klaviyo: segmentation, flows, testing, reporting, and performance.</p></li><li><p style=\"min-height:1.5em\">Manage calendars and execution for all lifecycle campaigns—product, promo, retention.</p></li><li><p style=\"min-height:1.5em\">Lead voice memo SMS campaigns and test new formats to boost loyalty.</p></li><li><p style=\"min-height:1.5em\">Collaborate with internal team (coordination, design, QA), with the ability to execute solo when needed.</p></li><li><p style=\"min-height:1.5em\">Oversee creative and strategic execution of direct mail efforts.</p></li></ul><p style=\"min-height:1.5em\"><strong>Subscription Growth</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Drive retention: winbacks, churn mitigation, loyalty, upsell, and save strategies.</p></li><li><p style=\"min-height:1.5em\">Partner with Marketing to evolve offerings, optimize onboarding, and personalize subscriber experiences.</p></li><li><p style=\"min-height:1.5em\">Use data (cohort analysis, predictive models) to identify opportunities for LTV growth.</p></li></ul><p style=\"min-height:1.5em\"><strong>Lifecycle Strategy</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Map and optimize customer journeys across touchpoints—onboarding, loyalty, reactivation, etc.</p></li><li><p style=\"min-height:1.5em\">Deploy behavioral segmentation to align messaging with customer needs.</p></li><li><p style=\"min-height:1.5em\">Run experiments across messaging, offers, and flow timing.</p></li></ul><p style=\"min-height:1.5em\"><strong>Analytics &amp; Insights</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Track key KPIs (LTV, churn, deliverability, subscription health, etc.).</p></li><li><p style=\"min-height:1.5em\">Translate findings into action across marketing, CX, and product teams.</p></li><li><p style=\"min-height:1.5em\">Proactively identify trends, risks, and opportunities.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>About You</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">4-6+ years in retention, lifecycle marketing, CRM, or subscription growth for e-commerce or consumer brands.</p></li><li><p style=\"min-height:1.5em\">Deep Klaviyo expertise, segmentation, deliverability, dynamic flows, analytics.</p></li><li><p style=\"min-height:1.5em\">Ability to “get a little dangerous” in Shopify — not a developer, but comfortable navigating themes, apps, templates, and basic troubleshooting.</p></li><li><p style=\"min-height:1.5em\">Familiarity with a retention tech-stack: SMS (we use Postscript), subscription platforms (we use Luna), and Direct Mail (we use PostPilot)</p></li><li><p style=\"min-height:1.5em\">Strong command of retention metrics: LTV, CAC:LTV, churn, cohorts, repeat rate, subscription KPIs.</p></li><li><p style=\"min-height:1.5em\">Analytical — proficiency in Excel/Sheets and comfort working with dashboards or BI tools like Triple Whale.</p></li><li><p style=\"min-height:1.5em\">Proven experience scaling retention programs in a high-growth DTC environment. Bonus if it’s a CPG, wellness or food brand.</p></li><li><p style=\"min-height:1.5em\">Experience managing or mentoring another marketer (e.g., coordinator or specialist).</p></li><li><p style=\"min-height:1.5em\">Comfort using AI to speed up workflow and experimentation.</p></li><li><p style=\"min-height:1.5em\">Exceptionally organized, detail-oriented, and operationally strong.</p></li></ul>",
      "job_url": "https://jobs.ashbyhq.com/fitt/05f2b8fe-8118-47e7-978a-c4fd8dd20946",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 100.0,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "Product Marketing Lead - Lifecycle",
      "job_category": "lifecycle_crm",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\"><strong>Fitt Talent Partners is a specialized recruitment firm for top health and wellness companies.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>We’re filling this role for a client, a longevity-focused, preventative healthcare platform.</strong></p><p style=\"min-height:1.5em\"></p><h2><strong>Job Description</strong></h2><p style=\"min-height:1.5em\">In this role, you own <strong>lifecycle and product messaging as a compounding system</strong>, not a set of campaigns. Email, landing pages, and in-product messaging are treated as one connected surface. Every change ships with a hypothesis. Performance is tracked by cohort, intent, and lifecycle stage. Weak work is cut quickly. High-signal work gets iterated and scaled.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">With that said, you should have a great intuition and taste for copywriting, messaging &amp; design. You can cultivate great experiments not just numerous experiments. You work hands-on. You ship real things. You operate directly in Figma, CMSs, and lifecycle tooling alongside Growth, Product, and Design.</p><p style=\"min-height:1.5em\"></p><h2><strong>Responsibilities</strong></h2><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Lifecycle and retention</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own all email and lifecycle flows for new members, active members, and re-engagement</p></li><li><p style=\"min-height:1.5em\">Treat email as a long-term system that compounds over time</p></li><li><p style=\"min-height:1.5em\">Continuously test, prune, and evolve flows based on cohort performance</p></li></ul><p style=\"min-height:1.5em\"><strong>Conversion and clarity</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own core landing pages and high-intent sub-pages</p></li><li><p style=\"min-height:1.5em\">Partner with Growth to experiment on positioning, structure, and messaging</p></li><li><p style=\"min-height:1.5em\">Ruthlessly remove confusion and cognitive load</p></li></ul><p style=\"min-height:1.5em\"><strong>Product and in-app messaging</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Define how the company explains itself inside the product</p></li><li><p style=\"min-height:1.5em\">Shape onboarding, education, nudges, and monetization moments</p></li><li><p style=\"min-height:1.5em\">Ensure in-app messaging is clear, human, and benefit-led</p></li></ul><p style=\"min-height:1.5em\"><strong>Customer voice</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Synthesize member behavior, objections, and feedback into clear recommendations</p></li><li><p style=\"min-height:1.5em\">Act as a translator between customer psychology and product decisions</p></li></ul><p style=\"min-height:1.5em\"></p><h2>About You</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Health obsessed - you have a strong, personal interest in longevity and preventive healthcare</p></li><li><p style=\"min-height:1.5em\">High-velocity operator - you work with urgency, and iterate rapidly to drive progress</p></li><li><p style=\"min-height:1.5em\">Ownership mindset - you take responsibility for outcomes and see work through from fuzzy idea to production impact</p></li><li><p style=\"min-height:1.5em\">Comfortable in chaos - you thrive in ambiguity, enjoy cross-functional collaboration, and have experience building 0→1 products</p></li><li><p style=\"min-height:1.5em\">Obsessive about details - you spot member friction before anyone else does</p></li><li><p style=\"min-height:1.5em\">Fascinated by customer psychology - you design for how people behave</p></li><li><p style=\"min-height:1.5em\">Background in marketing, UX, or design; PM experience is a plus but not required</p></li><li><p style=\"min-height:1.5em\">High IQ, even higher EQ - you read both systems and people with precision</p></li><li><p style=\"min-height:1.5em\">A sharp communicator and storyteller whose copy elevates the entire product</p></li><li><p style=\"min-height:1.5em\">Comfortable with ambiguity, cross-functional chaos, and building 0→1</p></li><li><p style=\"min-height:1.5em\">Bonus: Startup DNA - you were a founder or have early-stage startup experience</p></li></ul><h3></h3>",
      "job_url": "https://jobs.ashbyhq.com/fitt/1054151f-f5e6-4e2e-a56c-0b63233d6fb9",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 100.0,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "VP of Marketing ",
      "job_category": "marketing_leadership",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\"><strong>Fitt Talent Partners is a specialized recruitment firm for top health and wellness companies.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>We’re filling this role for a client, a design-forward technology company developing a category-defining breathing lamp.</strong></p><p style=\"min-height:1.5em\"></p><h2><strong>Job Description</strong></h2><p style=\"min-height:1.5em\">We’re looking for a VP of Marketing who can architect, operationalize, and scale the full go-to-market engine. This is a highly strategic, highly operational role responsible for driving demand generation, paid and organic growth, brand awareness, channel diversification, and revenue performance leading into (and beyond) launch.</p><p style=\"min-height:1.5em\">You’ll work cross-functionally with Product, Operations, and Leadership to turn us into a category-defining consumer brand.</p><p style=\"min-height:1.5em\">This is not a “brand-only” or “agency coordinator” role. It is a full-spectrum DTC hardware marketing leadership role—perfect for someone who has led a launch before and thrives in fast-moving early-stage environments.</p><p style=\"min-height:1.5em\"></p><h2><strong>Responsibilities</strong></h2><p style=\"min-height:1.5em\"><strong>GTM Strategy &amp; Leadership</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build end-to-end 2026 launch strategy pre-order</p></li><li><p style=\"min-height:1.5em\">Define positioning, messaging hierarchy, funnel architecture, and market sequencing</p></li><li><p style=\"min-height:1.5em\">Translate business goals into clear growth roadmaps, timelines, and budgets</p></li></ul><p style=\"min-height:1.5em\"><strong>Demand Generation &amp; Performance Marketing</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own paid channels (Meta, Google, YouTube, TikTok, affiliates, creators)</p></li><li><p style=\"min-height:1.5em\">Build and optimize performance funnels using data-driven testing and iteration</p></li><li><p style=\"min-height:1.5em\">Forecast CAC, ROAS, and spend efficiency with precision and transparency</p></li></ul><p style=\"min-height:1.5em\"><strong>Growth Ops, Analytics &amp; Forecasting</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop dashboards, KPIs, reporting cadences, and weekly performance reviews</p></li><li><p style=\"min-height:1.5em\">Partner with Finance to model scenarios, budgets, revenue projections, unit economics</p></li><li><p style=\"min-height:1.5em\">Present marketing performance to executives and investors</p></li></ul><p style=\"min-height:1.5em\"><strong>Lifecycle, CRM &amp; Email</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Architect and optimize the end-to-end customer journey</p></li><li><p style=\"min-height:1.5em\">Improve conversion, retention, LTV, and product education through CRM programs</p></li><li><p style=\"min-height:1.5em\">Own segmentation, automation, testing, and creative strategy</p></li></ul><p style=\"min-height:1.5em\"><strong>Creator, Affiliate, PR &amp; Community</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build a systematized creator/influencer/affiliate engine</p></li><li><p style=\"min-height:1.5em\">Work with internal and external partners to secure meaningful earned visibility</p></li><li><p style=\"min-height:1.5em\">Support community growth initiatives and brand activation opportunities</p></li></ul><p style=\"min-height:1.5em\"><strong>Web, CRO &amp; Conversion</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own the performance of the website as a revenue engine</p></li><li><p style=\"min-height:1.5em\">Establish testing frameworks, landing page experiments, CRO strategy</p></li><li><p style=\"min-height:1.5em\">Coordinate with design/dev partners to improve speed, clarity, and conversion</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>About You</strong></h2><p style=\"min-height:1.5em\">You bring structure, clarity, and decisiveness. You don’t wait for direction — you present options, tradeoffs, and expected outcomes. You can zoom out to messaging and positioning, then zoom into CAC, landing page experiments, or CRM flows. You’ve worked in fast-moving early-stage environments and know how to balance scrappy execution with strategic clarity. You love dashboards, testing frameworks, and turning insights into action. Ideally you’ve led GTM for a physical consumer product — bonus if in health, wellness, fitness, or wearable tech. You partner well with Creative, Product, Ops, and Leadership. You know when to challenge and when to support.</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">6–12+ years of marketing experience, ideally with 3–5 in senior leadership</p></li><li><p style=\"min-height:1.5em\">Proven experience launching and scaling a DTC hardware or wellness brand</p></li><li><p style=\"min-height:1.5em\">Strong analytical skills and fluency with marketing data platforms</p></li><li><p style=\"min-height:1.5em\">Experience managing creative teams, agencies, and cross-functional workflows</p></li><li><p style=\"min-height:1.5em\">Strong narrative and communication abilities</p></li><li><p style=\"min-height:1.5em\">Comfort operating in fast-moving, ambiguous startup environments</p></li></ul>",
      "job_url": "https://jobs.ashbyhq.com/fitt/406ac023-bd54-46ae-bc02-55e320f75214",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 100.0,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "Sales & Revenue Growth Manager",
      "job_category": "growth_marketing",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\"><strong>Fitt Talent Partners is a specialized recruitment firm working with top health, fitness, and wellness companies.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>We’re filling this role for a client – a modern wellness destination rooted in whole-body health, longevity, beauty, and nervous system regulation.</strong></p><p style=\"min-height:1.5em\"></p><h2><strong>Job Description</strong></h2><p style=\"min-height:1.5em\"> We are seeking a Sales &amp; Revenue Growth Manager to fully own and drive top-line revenue across all channels. This role is accountable for strategy, execution, optimization, and results for customer acquisition, conversion, retention, and lifetime value.</p><p style=\"min-height:1.5em\">This is a hands-on, results-driven executive role, not a passive leadership position. You will build, execute, and scale our revenue engine across paid media, organic growth, partnerships, email/SMS, events, community activations, outbound efforts, and on-site/off-site lead generation, while consistently meeting and exceeding revenue targets.</p><p style=\"min-height:1.5em\">This leader will serve as the chief architect of our growth and monetization strategy, translating brand vision into predictable, scalable revenue.</p><p style=\"min-height:1.5em\"></p><h2><strong>Responsibilities</strong></h2><p style=\"min-height:1.5em\"><strong>Revenue Ownership &amp; Forecasting</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own 100% of revenue performance across all offerings (memberships, services, packages, medical/wellness services, events, retail, add-ons)</p></li><li><p style=\"min-height:1.5em\">Set and manage monthly, quarterly, and annual revenue targets</p></li><li><p style=\"min-height:1.5em\">Build revenue forecasts, dashboards, and reporting systems</p></li><li><p style=\"min-height:1.5em\">Identify and execute new revenue streams, pricing strategies, packaging, upsells, and cross-sells</p></li><li><p style=\"min-height:1.5em\">Ensure predictable, repeatable, and scalable revenue growth</p></li></ul><p style=\"min-height:1.5em\"><strong>Customer Acquisition &amp; Growth Channels</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Paid Advertising</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead paid acquisition strategy across Meta, Google, TikTok, YouTube, and emerging platforms</p></li><li><p style=\"min-height:1.5em\">Own Customer Acquisition Cost (CAC) targets and ROI</p></li><li><p style=\"min-height:1.5em\">Oversee funnel strategy, landing pages, conversion tracking, creative testing, and optimization</p></li><li><p style=\"min-height:1.5em\">Manage agencies or in-house teams as needed</p></li></ul></li><li><p style=\"min-height:1.5em\">Organic &amp; Community Growth</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Drive organic lead generation through social media, content, SEO, referrals, and community initiatives</p></li><li><p style=\"min-height:1.5em\">Partner with brand and content teams to align messaging with conversion goals</p></li><li><p style=\"min-height:1.5em\">Build systems that convert organic engagement into measurable revenue</p></li></ul></li><li><p style=\"min-height:1.5em\">Email, SMS &amp; CRM</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own email and SMS strategy end-to-end, including:</p></li><li><p style=\"min-height:1.5em\">Lead nurture sequences</p></li><li><p style=\"min-height:1.5em\">Conversion campaigns</p></li><li><p style=\"min-height:1.5em\">Retention and reactivation</p></li></ul></li></ul><p style=\"min-height:1.5em\"><strong>Sales Systems, Pipelines &amp; Conversion</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design and manage end-to-end sales funnels from first touch to close</p></li><li><p style=\"min-height:1.5em\">Own lead qualification, follow-up systems, conversion optimization, and close rates</p></li><li><p style=\"min-height:1.5em\">Build SOPs for inbound and outbound sales processes</p></li><li><p style=\"min-height:1.5em\">Ensure seamless handoff between marketing, sales, and operations</p></li><li><p style=\"min-height:1.5em\">Track and optimize KPIs such as conversion rate, close rate, LTV, churn, and retention</p></li></ul><p style=\"min-height:1.5em\"><strong>Events, Partnerships &amp; Off-Site Lead Generation</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Plan and execute external events, pop-ups, workshops, brand activations, and partnerships to generate new leads</p></li><li><p style=\"min-height:1.5em\">Own off-site and community-based growth strategies (corporate wellness, local partnerships, influencers, referral partners)</p></li><li><p style=\"min-height:1.5em\">Develop systems to capture, nurture, and convert event-generated leads</p></li><li><p style=\"min-height:1.5em\">Measure ROI of all events and partnerships</p></li></ul><p style=\"min-height:1.5em\"><strong>Data, Analytics &amp; Optimization</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own all revenue-related reporting and analytics</p></li><li><p style=\"min-height:1.5em\">Track performance across channels and adjust strategy quickly</p></li><li><p style=\"min-height:1.5em\">Use data to drive decisions, experiments, and optimizations</p></li><li><p style=\"min-height:1.5em\">Present clear insights and recommendations to leadership</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Requirements</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">7–10+ years of experience in sales, revenue growth, or performance marketing leadership</p></li><li><p style=\"min-height:1.5em\">Proven track record of owning and scaling revenue</p></li><li><p style=\"min-height:1.5em\">Strong understanding of paid ads, funnels, email/SMS, organic growth, and attribution</p></li><li><p style=\"min-height:1.5em\">Experience with events, partnerships, and community-based lead generation</p></li><li><p style=\"min-height:1.5em\">Analytical, strategic, and execution-focused</p></li><li><p style=\"min-height:1.5em\">Comfortable in a fast-growing, founder-led environment</p></li><li><p style=\"min-height:1.5em\">Wellness, fitness, medical, hospitality, or lifestyle brand experience a strong plus</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Location</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">This position is located in Las Vegas, NV</p></li></ul>",
      "job_url": "https://jobs.ashbyhq.com/fitt/fbee8cfc-bce8-42bb-9f5c-a295f7efa322",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 100.0,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "Head of Design - Brand & Product ",
      "job_category": "brand_marketing",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\"><strong>Fitt Talent Partners is a specialized recruitment firm for top health and wellness companies.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>We’re filling this role for a client, a patient-first digital health company transforming care for mold-related and chronic inflammatory conditions through cutting-edge diagnostics, virtual treatment, and compassionate support.</strong></p><p style=\"min-height:1.5em\"></p><h2><strong>Job Description</strong></h2><p style=\"min-height:1.5em\">We’re seeking a Founding Designer, Brand &amp; Product who can own and elevate every part of our design system—from our website to our care app to our growth assets. This is a role for a designer who sets the creative bar, understands patients deeply, and collaborates closely with PMs, engineering, clinical leadership, and growth. You’ll shape the emotional, functional, and visual experience that patients rely on as they navigate complex health issues.</p><p style=\"min-height:1.5em\"></p><h2><strong>Responsibilities</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Brand &amp; Visual Identity</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design clean, modern, intuitive experiences that feel delightful to users.</p></li><li><p style=\"min-height:1.5em\">Build and scale visual language across product, web, and marketing.</p></li><li><p style=\"min-height:1.5em\">Create a consistent system that communicates trust, clarity, and compassion.</p></li><li><p style=\"min-height:1.5em\">Evolve the brand to help patients feel seen, supported, and guided.</p></li></ul></li><li><p style=\"min-height:1.5em\">Product &amp; Patient Experience</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own end-to-end UI for our web experience, onboarding, lab flows, test results, care<br />plans, and app.</p></li><li><p style=\"min-height:1.5em\">Translate medically complex concepts into simple, intuitive, empathetic interfaces.</p></li><li><p style=\"min-height:1.5em\">Collaborate tightly with PMs, engineering, and clinicians to ship fast without<br />compromising craft.</p></li><li><p style=\"min-height:1.5em\">Reduce cognitive load for symptomatic patients (fatigue, brain fog, overwhelm) through thoughtful interaction design.</p></li></ul></li><li><p style=\"min-height:1.5em\">Marketing &amp; Growth Design</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design high-performing ad assets, landing pages, and systems for user acquisition.</p></li><li><p style=\"min-height:1.5em\">Ensure brand and product feel seamlessly connected across all patient touchpoints.</p></li></ul></li><li><p style=\"min-height:1.5em\">Design Systems &amp; Foundations</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build and maintain a scalable design system across surfaces.</p></li><li><p style=\"min-height:1.5em\">Define patterns, components, and frameworks that support rapid iteration.</p></li><li><p style=\"min-height:1.5em\">Lay the groundwork for a future design team and help recruit top talent as we scale.</p></li></ul></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Requirements </strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5–8+ years of experience in product design, brand design, or a hybrid design role.</p></li><li><p style=\"min-height:1.5em\">Experience working with Figma, Framer, Adobe Creative Suite (Indesign, Illustrator, Photoshop) and experience working with AI-photogenerating tools</p></li><li><p style=\"min-height:1.5em\">A portfolio demonstrating strong craft and systems thinking across UX, UI, and visual identity.</p></li><li><p style=\"min-height:1.5em\">Experience designing for consumer health, wellness, or emotionally sensitive user journeys.</p></li><li><p style=\"min-height:1.5em\">Strong ability to translate complexity into clarity, especially in clinical or data-heavy contexts.</p></li><li><p style=\"min-height:1.5em\">Comfort working end-to-end: research, flows, wireframes, UI, assets, prototyping, QA.</p></li><li><p style=\"min-height:1.5em\">Ability to work in fast-moving environments where direction evolves quickly.</p></li><li><p style=\"min-height:1.5em\">High user empathy, especially for patients navigating chronic symptoms.</p></li><li><p style=\"min-height:1.5em\">Strong communication and collaboration with engineering, PMs, clinicians, and growth.</p></li><li><p style=\"min-height:1.5em\">A mindset that blends speed with intention. Patient experience matters, quality matters, clarity matters.</p></li></ul><h2></h2>",
      "job_url": "https://jobs.ashbyhq.com/fitt/d821073d-6ae5-4c1f-81be-732b9ac6d4f3",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 100.0,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "LlamaIndex",
      "company_domain": "llamaindex.ai",
      "ats_provider": "ashby",
      "job_title": "Technical Product Marketing Manager",
      "job_category": "product_marketing",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\"><strong>Join us and help shape the future of AI by defining the narrative around document understanding.</strong></p><p style=\"min-height:1.5em\"></p><h1><strong>Role Overview</strong></h1><p style=\"min-height:1.5em\">We're seeking a founding PMM (from associate to Principal). You’ll help shape core storytelling and GTM activities, actively shaping how the product is understood and discovered by enterprises,  developers, and AI practitioners. This role blends messaging, go-to-market execution, content creation, and enablement,  perfect for a PMM who loves working cross-functionally and getting their hands dirty. We are also open to former client-facing technical roles that want to transition into PMM and have a deep obsession with the voice of the customer.</p><p style=\"min-height:1.5em\"></p><h1>You’ll own key areas</h1><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>ICP Research &amp; Storytelling</strong> – staying close to the voice of the customer and market research to help position LlamaIndex in a dynamic AI ecosystem.</p></li><li><p style=\"min-height:1.5em\"><strong>Technical Content and Demos: </strong>Developer technical content and end-to-end demos of our core tech<strong> </strong></p></li><li><p style=\"min-height:1.5em\"><strong>Sales &amp; Developer Enablement</strong> – creating content that helps our sales and community teams explain value clearly and enact sales plays.</p></li><li><p style=\"min-height:1.5em\"><strong>Product Launches</strong> – bringing new features and frameworks to market with clear and compelling story telling..</p></li><li><p style=\"min-height:1.5em\"><strong>Partner Enablement </strong>- Drive the creation of joint solution diagrams, better together stories, and  vertical plays for strategic partners. </p></li></ol><p style=\"min-height:1.5em\">You’ll work closely with product, growth, community, and GTM teams to craft narratives, drive adoption, and learn from users.</p><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><p style=\"min-height:1.5em\"></p><h2><strong>Own Product Launches</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Partner with product and engineering to understand upcoming features and modules.</p></li><li><p style=\"min-height:1.5em\">Draft launch briefs, messaging docs, and GTM plans.</p></li><li><p style=\"min-height:1.5em\">Create launch materials — blog posts, release notes, demo scripts, launch emails, and social content.</p></li><li><p style=\"min-height:1.5em\">Coordinate launch timelines and ensure consistency across channels (docs, community, sales).</p></li><li><p style=\"min-height:1.5em\">Track launch impact (engagement, adoption, conversion).<br /></p></li></ul><h2><strong>Create Developer-Centric Messaging &amp; Content</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Translate technical concepts into clear, authentic stories developers understand.</p></li><li><p style=\"min-height:1.5em\">Write use-case content, walkthroughs, and case studies for core ICPs (e.g., data engineers, ML engineers, AI platform teams).</p></li><li><p style=\"min-height:1.5em\">Collaborate with dev rel, product, and sales to align messaging on features, pricing, and differentiators.</p></li><li><p style=\"min-height:1.5em\">Help maintain LlamaIndex’s messaging and positioning framework.<br /></p></li></ul><h2><strong>Support Sales &amp; Growth Enablement</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build and update decks, battlecards, one-pagers, and competitive guides for the sales and partnerships teams.</p></li><li><p style=\"min-height:1.5em\">Develop internal training materials and quick-reference content for field teams.</p></li><li><p style=\"min-height:1.5em\">Collect insights from sales calls and developer community feedback to improve messaging.<br /></p></li></ul><h2><strong>Understand the Market &amp; Users</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Research developer trends, competing frameworks, and open-source activity.</p></li><li><p style=\"min-height:1.5em\">Interview users and analyze feedback from GitHub, Discord, and customer accounts.<br />Maintain and evolve ICP profiles (e.g., developer vs. enterprise personas).<br /></p></li></ul><h2><strong>Measure &amp; Iterate</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Define simple success metrics for each launch or campaign (signups, docs traffic, content usage).</p></li><li><p style=\"min-height:1.5em\">Use feedback loops from users, growth metrics, and community engagement to refine your approach.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">3–6 years of experience in <strong>product marketing</strong>, <strong>developer marketing</strong>, <strong>technical content</strong>, or <strong>growth marketing</strong>.</p></li><li><p style=\"min-height:1.5em\">Strong writing and storytelling skills,  you can explain technical topics clearly.</p></li><li><p style=\"min-height:1.5em\">A solid grasp of developer workflows, open-source ecosystems, or AI/ML tools.</p></li><li><p style=\"min-height:1.5em\">Comfortable with hands-on execution: writing blog posts, updating decks, building Notion pages, or editing short videos.</p></li><li><p style=\"min-height:1.5em\">Collaborative, curious, and organized , you thrive in fast-moving, cross-functional environments.</p></li><li><p style=\"min-height:1.5em\">Data-driven and eager to learn from results.</p></li><li><p style=\"min-height:1.5em\">Bonus: Hands on coding experience with LLM frameworks, RAG systems, vector databases, or developer communities.<br /></p></li></ul><h1><strong>Why You’ll Love This Role</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Be part of the frontier:</strong> Work with cutting-edge AI and open-source technology.<br /><strong>Shape the narrative:</strong> Help define how developers adopt and understand LLM infrastructure.</p></li><li><p style=\"min-height:1.5em\"><strong>Learn fast:</strong> Work closely with technical founders and a small, high-impact team.</p></li><li><p style=\"min-height:1.5em\"><strong>Grow your scope:</strong> Build launch playbooks, content systems, and positioning foundations from the ground up.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate with amazing devs:</strong> Our community spans 100K+ developers building next-gen AI apps.</p></li></ul><h2><strong>Location</strong></h2><p style=\"min-height:1.5em\">We offer a hybrid-friendly culture based out of our downtown San Francisco office.</p><h2><strong>Why Join Us?</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Impactful Mission:</strong> Work on innovative AI products that redefine how knowledge is accessed and utilized.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborative Team:</strong> Join a team of passionate individuals committed to pushing the boundaries of technology.</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Opportunities:</strong> Be at the forefront of the AI revolution, with ample opportunities to grow alongside our scaling organization.</p></li></ul><h2><strong>Additional Benefits:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Competitive base salary and equity compensation</p></li><li><p style=\"min-height:1.5em\">Comprehensive medical/dental/vision coverage for you and your family</p></li><li><p style=\"min-height:1.5em\">Unlimited paid time off policy</p></li><li><p style=\"min-height:1.5em\">Daily catered lunch and snacks in the San Francisco office</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</strong></em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>LlamaIndex does not accept unsolicited agency resumes. Please do not forward resumes to our jobs alias, employees, or any other organization location. LlamaIndex is not responsible for any fees related to unsolicited resumes.</strong></em></p>",
      "job_url": "https://jobs.ashbyhq.com/llamaindex/2688f24c-0516-423f-a908-2e665d19060d",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:42.702124",
      "relevance_score": 100.0,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "LlamaIndex",
      "company_domain": "llamaindex.ai",
      "ats_provider": "ashby",
      "job_title": "Lead Product Manager",
      "job_category": "product_marketing",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\"><strong>Join us and help shape the future of AI by defining the narrative around document understanding.</strong></p><p style=\"min-height:1.5em\"></p><h2>About the role</h2><p style=\"min-height:1.5em\">LlamaIndex is on a mission to revolutionize how organizations utilize their knowledge by building cutting-edge AI-powered agents/tools to enhance enterprise knowledge workflows. As a Lead Product Manager, you will play a pivotal role in shaping the future of our products, ensuring they meet the needs of developers.</p><p style=\"min-height:1.5em\"></p><h2>What we are looking for</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Deep understanding of developer tools and developer pain points</p></li><li><p style=\"min-height:1.5em\">Domain understanding of AI and AI agent use cases</p></li><li><p style=\"min-height:1.5em\">Customer obsession and consultative mindset</p></li><li><p style=\"min-height:1.5em\">Ability to navigate ambiguity and drive results</p></li><li><p style=\"min-height:1.5em\">Collaborative spirit and eagerness to help others succeed</p></li></ul><h2>Responsibilities</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Drive Product Vision &amp; Strategy: </strong>Define and execute the product roadmap for our core offerings, balancing developer-centric innovations with enterprise needs.</p></li><li><p style=\"min-height:1.5em\"><strong>Lead End-to-End Execution: </strong>Oversee product lifecycle stages from ideation to launch, iterating quickly based on user feedback and data insights. This involves personally test driving your products end to end, writing documentation where needed etc.</p></li><li><p style=\"min-height:1.5em\"><strong>Engage with Users: </strong>Proactively interact with developers and enterprise users to understand pain points, gather feedback, and foster strong relationships.</p></li><li><p style=\"min-height:1.5em\"><strong>Define Success Metrics: </strong>Establish and track KPIs to measure the success of product launches and ongoing performance.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate Across Teams: </strong>Work closely with engineering, design, and go-to-market teams to align priorities, ensure seamless delivery, and maximize product impact.</p></li><li><p style=\"min-height:1.5em\"><strong>Act as a Domain Expert: </strong>Develop expertise in AI-driven solutions and customer workflows to guide strategic product decisions.</p></li><li><p style=\"min-height:1.5em\"><strong>Evangelize the Product: </strong>Represent LlamaIndex at conferences, webinars, and community events, showcasing our technology and gathering insights.</p></li></ul><h2>Qualifications</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Experienced Leader: </strong>4+ years of product management experience, including ownership of developer-facing tools or enterprise SaaS solutions.</p></li><li><p style=\"min-height:1.5em\"><strong>Technical Aptitude: </strong>Strong understanding of APIs, SDKs, and Dev tools. Familiarity with AI/ML is a plus.</p></li><li><p style=\"min-height:1.5em\"><strong>Customer-Obsessed: </strong>A track record of solving complex problems by deeply understanding customer needs and translating them into actionable solutions.</p></li><li><p style=\"min-height:1.5em\"><strong>Data-Driven Decision Maker:</strong> Ability to leverage data to guide product strategy and validate decisions.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborative across teams:</strong> Proven ability to work cross-functionally in fast-paced environments, aligning diverse teams to deliver impactful results.</p></li><li><p style=\"min-height:1.5em\"><strong>Strong Communicator: </strong>Exceptional written and verbal communication skills, capable of influencing internal stakeholders and engaging external audiences.</p></li><li><p style=\"min-height:1.5em\"><strong>AI Enthusiast:</strong> Excited about driving AI adoption and its transformative potential for businesses.</p></li><li><p style=\"min-height:1.5em\"><strong>Hands-On Problem Solver: </strong>Willing to dive into technical details and provide practical solutions when needed.</p></li></ul><h2>Preferred Qualifications</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Demonstrated ability to successfully launch 0-to-1 products in a SaaS or developer tools context.</p></li><li><p style=\"min-height:1.5em\">Experience with enterprise sales cycles and go-to-market strategies at a fast growing company.</p></li><li><p style=\"min-height:1.5em\">An early adopter of AI technology with a passion for staying ahead of emerging trends.</p></li><li><p style=\"min-height:1.5em\">Experience leading teams or initiatives in the AI/ML or knowledge management space.</p></li></ul><h2>Location</h2><p style=\"min-height:1.5em\">We offer a hybrid-friendly culture based out of our downtown San Francisco office.</p><p style=\"min-height:1.5em\"></p><h2><strong>Why Join Us?</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Impactful Mission:</strong> Work on innovative AI products that redefine how knowledge is accessed and utilized.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborative Team:</strong> Join a team of passionate individuals committed to pushing the boundaries of technology.</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Opportunities:</strong> Be at the forefront of the AI revolution, with ample opportunities to grow alongside our scaling organization.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Additional Benefits:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Competitive base salary and equity compensation</p></li><li><p style=\"min-height:1.5em\">Comprehensive medical/dental/vision coverage for you and your family</p></li><li><p style=\"min-height:1.5em\">Unlimited paid time off policy</p></li><li><p style=\"min-height:1.5em\">Daily catered lunch and snacks in the San Francisco office</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</strong></em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>LlamaIndex does not accept unsolicited agency resumes. Please do not forward resumes to our jobs alias, employees, or any other organization location. LlamaIndex is not responsible for any fees related to unsolicited resumes.</strong></em></p>",
      "job_url": "https://jobs.ashbyhq.com/llamaindex/0d746429-0038-4ab1-950e-321f09084d4b",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:42.702124",
      "relevance_score": 91.71428571428571,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "R&D and Commercialization Manager (Meat Snacks)",
      "job_category": "seo",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\"><strong>Fitt Talent Partners is a specialized recruitment firm for top health and wellness companies.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>We’re filling this role for a client, a real-food nutrition company focused on regeneratively raised meat snacks and supplements, crafted to make eating like a human easy, honest, and impactful.</strong></p><p style=\"min-height:1.5em\"></p><h2><strong>Job Description</strong></h2><p style=\"min-height:1.5em\">You'll work with the team to drive the next phase of meat snacking innovation, built on regenerative agriculture, nutritional integrity, and real food. We believe meat snacks should come from whole, recognizable ingredients, not synthetics or isolates, and we're looking for someone who shares that conviction.</p><p style=\"min-height:1.5em\">As the Meat Scientist, you will own the end-to-end product lifecycle for the meat snacking portfolio. This includes R&amp;D, commercialization, quality oversight specific to meat products, and ongoing manufacturing management. You will be instrumental in expanding our product offerings while maintaining our strict standards for sourcing, quality, and compliance.</p><p style=\"min-height:1.5em\"><strong>You MUST have deep experience working in the meat snack category to be considered for this role.</strong></p><p style=\"min-height:1.5em\"></p><h2><strong>Responsibilities</strong></h2><p style=\"min-height:1.5em\"><strong>Product Development &amp; Optimization</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own our Meat Snacking Product suite, including all SKUs.</p></li><li><p style=\"min-height:1.5em\">Drive product development of new SKUs and line extensions from concept to launch.</p></li><li><p style=\"min-height:1.5em\">Lead product improvement initiatives for existing SKUs, focusing on sensory attributes, shelf stability, and cost optimization without compromising quality.</p></li><li><p style=\"min-height:1.5em\">Develop and maintain specifications, formulas, and processing parameters for all meat snack products.</p></li><li><p style=\"min-height:1.5em\">Support R&amp;D by working with manufacturing development prototypes in lab and pilot settings.</p></li><li><p style=\"min-height:1.5em\">Lead building supply chains in regenerative agriculture ensuring support to the suppliers that need brands like us to thrive.</p></li></ul><p style=\"min-height:1.5em\"><strong>Commercialization &amp; Manufacturing</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Plan and execute all production trials, including first production runs, ensuring successful scale-up and adherence to specifications.</p></li><li><p style=\"min-height:1.5em\">Serve as the primary technical point of contact for ongoing manufacturing relationships with co-packers.</p></li><li><p style=\"min-height:1.5em\">Oversee the transition from R&amp;D to first production, including packaging review, final specification sign-off, and labeling accuracy.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the QA team to ensure all meat products meet strict food safety (USDA/FDA, HACCP/HARPC), quality, and regulatory compliance standards.</p></li><li><p style=\"min-height:1.5em\">Develop repeatable processes that accelerate quality-compliant concept-to-launch timelines for meat products.</p></li></ul><p style=\"min-height:1.5em\"><strong>Operations &amp; Relationship Management</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Serve as the day-to-day point of contact for co-manufacturers to manage production timelines, troubleshoot technical issues, and ensure specification adherence.</p></li><li><p style=\"min-height:1.5em\">Travel onsite frequently for production runs, quality audits, troubleshooting, and relationship building.</p></li><li><p style=\"min-height:1.5em\">Drive accountability on documentation, batch accuracy, and adherence to specs.</p></li><li><p style=\"min-height:1.5em\">Identify opportunities to streamline quality processes, reduce waste, and enhance overall product quality and safety within the meat snack category.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>About You</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">6+ years of experience in meat snack manufacturing, product development, or food science specifically focused on meat products (jerky, sticks, bars, etc.).</p></li><li><p style=\"min-height:1.5em\">Bachelor’s degree in Meat Science, Food Science, or a related field; advanced degree preferred.</p></li><li><p style=\"min-height:1.5em\">Strong understanding of USDA/FDA regulatory compliance, food safety principles (HACCP/HARPC), and GMPs specific to meat product processing.</p></li><li><p style=\"min-height:1.5em\">Proven success working with co-manufacturers/co-packers and leading technical scale-up in fast-paced innovation cycles.</p></li><li><p style=\"min-height:1.5em\">Experience in formula creation, process development, and managing production trials.</p></li><li><p style=\"min-height:1.5em\">Excellent project management and cross-functional communication skills.</p></li><li><p style=\"min-height:1.5em\">Comfortable in a lean, high-growth environment.</p></li><li><p style=\"min-height:1.5em\">Ability to balance high-level strategy with hands-on execution (e.g., prototype development, batch troubleshooting).</p></li><li><p style=\"min-height:1.5em\">Strong organizational systems and bias for action.</p></li><li><p style=\"min-height:1.5em\">Willingness to travel frequently for site visits, production trials, and audits.</p></li></ul>",
      "job_url": "https://jobs.ashbyhq.com/fitt/6a9889b5-d541-4c5c-b39d-8de837e71e74",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 86.77777777777777,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "VP of Operations ",
      "job_category": "marketing_leadership",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\"><strong>Fitt Talent Partners is a specialized recruitment firm working with top health, fitness, and wellness companies. </strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>We’re filling this role for a client - A luxury social wellness club focused on holistic health and community.</strong></p><p style=\"min-height:1.5em\"></p><h2>Job Description </h2><p style=\"min-height:1.5em\">The VP of Operations owns four-wall unit economics, operational execution, and GM performance across all clubs.</p><p style=\"min-height:1.5em\">This leader is responsible for making sure that what is planned actually happens, consistently, on time, and at a high standard. The role requires deep operational fluency, strong financial acumen, hands on leadership, and the ability to represent the brand with confidence and credibility. This is a roll up your sleeves role. All corporate leaders here spend time working in-club, and the VP of Operations is expected to understand every touchpoint, service, and guest interaction intimately.</p><p style=\"min-height:1.5em\"></p><h2>Responsibilities </h2><p style=\"min-height:1.5em\">Four-Wall Economics &amp; Financial Ownership (Critical)</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Fully own and continuously improve four-wall unit economics across all clubs</p></li><li><p style=\"min-height:1.5em\">Partner closely with the finance team to track, analyze, and improve:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Revenue by service line</p></li><li><p style=\"min-height:1.5em\">Provider productivity and utilization</p></li><li><p style=\"min-height:1.5em\">Labor efficiency and scheduling</p></li><li><p style=\"min-height:1.5em\">Membership performance and retention</p></li><li><p style=\"min-height:1.5em\">Event revenue and profitability</p></li></ul></li><li><p style=\"min-height:1.5em\">Translate financial data into clear priorities and expectations for GMs</p></li><li><p style=\"min-height:1.5em\">Use data, not instinct, to drive operational decisions and performance improvement</p></li></ul><p style=\"min-height:1.5em\">Multi-Club Operations Leadership</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Oversee all day to day operations across all clubs</p></li><li><p style=\"min-height:1.5em\">Make sure operational standards, brand experience, and execution consistency across markets</p></li><li><p style=\"min-height:1.5em\">Understand every club touchpoint “like the back of your hand,” from front desk to treatment rooms to events</p></li><li><p style=\"min-height:1.5em\">Serve as senior operational leader in club when the Founder is not present</p></li><li><p style=\"min-height:1.5em\">Confidently lead tours and high level conversations with partners, VIP guests, and stakeholders</p></li></ul><p style=\"min-height:1.5em\">General Manager Leadership &amp; Accountability</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Directly manage all General Managers</p></li><li><p style=\"min-height:1.5em\">Conduct structured weekly one-on-one meetings with each GM</p></li><li><p style=\"min-height:1.5em\">Own GM performance management, including:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Financial results</p></li><li><p style=\"min-height:1.5em\">KPI tracking</p></li><li><p style=\"min-height:1.5em\">Goal setting and follow through</p></li><li><p style=\"min-height:1.5em\">Accountability and course correction</p></li></ul></li><li><p style=\"min-height:1.5em\">Make sure GMs are clear on priorities and consistently executing against them</p></li><li><p style=\"min-height:1.5em\">Build a culture of ownership, reliability, and disciplined execution at the GM level</p></li></ul><p style=\"min-height:1.5em\">Implementation &amp; Execution Excellence</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own the rollout and execution of all new club enhancements and operational initiatives</p></li><li><p style=\"min-height:1.5em\">Make sure all marketing initiatives created by the marketing team are properly implemented in club</p></li><li><p style=\"min-height:1.5em\">Track execution, follow up on gaps, and hold GMs accountable for results</p></li><li><p style=\"min-height:1.5em\">Eliminate friction between strategy and execution</p></li></ul><p style=\"min-height:1.5em\">Training, Onboarding &amp; People Operations</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Fine-tune and continuously improve onboarding and training processes for new hires</p></li><li><p style=\"min-height:1.5em\">Make sure training standards are consistent and scalable across all clubs</p></li><li><p style=\"min-height:1.5em\">Oversee club level HR operations in partnership with People/HR teams</p></li><li><p style=\"min-height:1.5em\">Make sure compliance with labor laws, policies, and our standards</p></li></ul><p style=\"min-height:1.5em\"></p><h2>Experience </h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">10+ years of experience in multi-unit operations leadership</p></li><li><p style=\"min-height:1.5em\">Strong background in hospitality, wellness, fitness, lifestyle, or service-based businesses</p></li><li><p style=\"min-height:1.5em\">Proven financial acumen with the ability to manage P&amp;Ls and unit economics</p></li><li><p style=\"min-height:1.5em\">Experience leading GMs or senior operators across multiple locations</p></li><li><p style=\"min-height:1.5em\">Comfortable operating in high-touch, luxury, brand-driven environments</p></li></ul>",
      "job_url": "https://jobs.ashbyhq.com/fitt/6d6cc16e-d186-49fe-996f-77df37baaa9d",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 73.51612903225806,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "Controller ",
      "job_category": "content_marketing",
      "department": null,
      "location": null,
      "job_description": "<h2><strong>About the Role</strong></h2><p style=\"min-height:1.5em\">We’re looking for a part-time Controller to help bring clarity and structure to our company’s financial operations. We operate several business units and each needs its own financial picture and departmental P&amp;L tracking.</p><p style=\"min-height:1.5em\">This person should be highly detail-oriented and strategic — someone who can dig into the numbers, organize our revenue and expenses by department, and help us make data-driven decisions about growth, hiring, and profitability.</p><p style=\"min-height:1.5em\">You’ll work closely with leadership to establish scalable accounting processes, ensure accurate reporting, and provide the insights needed to manage cash flow and departmental performance.</p><p style=\"min-height:1.5em\"></p><h2><strong>Key Responsibilities</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Create and maintain department-level P&amp;L statements for each business unit</p></li><li><p style=\"min-height:1.5em\">Categorize all revenue and expenses by department, ensuring transactions are allocated correctly</p></li><li><p style=\"min-height:1.5em\">Review shared or lump-sum transactions and itemize or allocate costs across departments as needed</p></li><li><p style=\"min-height:1.5em\">Partner with leadership to track profitability by department</p></li><li><p style=\"min-height:1.5em\">Assist with accounting processes including month-end close, reconciliations, and reporting</p></li><li><p style=\"min-height:1.5em\">Develop systems or tools (e.g., spreadsheets, dashboards, or integrations with QuickBooks) for more transparent and efficient tracking</p></li><li><p style=\"min-height:1.5em\">Monitor cash flow and budgeting, flagging risks and opportunities</p></li><li><p style=\"min-height:1.5em\">Support financial forecasting and staffing planning based on client volume and growth projections</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Qualifications</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years in accounting or controllership roles, preferably with non-profit or startup experience</p></li><li><p style=\"min-height:1.5em\">Strong understanding of multi-department or multi-entity financial reporting</p></li><li><p style=\"min-height:1.5em\">Expertise in QuickBooks or similar accounting software</p></li><li><p style=\"min-height:1.5em\">Advanced proficiency in Excel or Google Sheets (data modeling, pivots, and lookups)</p></li><li><p style=\"min-height:1.5em\">Proven ability to allocate shared expenses and reconcile departmental reporting</p></li><li><p style=\"min-height:1.5em\">Strong communication and documentation skills — able to turn complex financial data into clear insights</p></li><li><p style=\"min-height:1.5em\">Prior fractional, consulting, or small-business controller experience preferred</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>What Success Looks Like</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Each business unit has clear, accurate, and regularly updated financials</p></li><li><p style=\"min-height:1.5em\">Shared costs and cross-department expenses are correctly allocated</p></li><li><p style=\"min-height:1.5em\">Profit-share calculations are reliable and easy to review</p></li><li><p style=\"min-height:1.5em\">Leadership has real-time visibility into department-level performance, cash flow, and hiring readiness</p><p style=\"min-height:1.5em\"></p></li></ul><h2><strong>Role Details</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Part-time with potential to expand to full-time</p></li><li><p style=\"min-height:1.5em\">Location: Pittsburgh, PA</p></li></ul>",
      "job_url": "https://jobs.ashbyhq.com/fitt/7a28466e-ddcf-4076-8cc9-3ad3e0f38142",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 61.8235294117647,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    },
    {
      "company_name": "Fitt Insider",
      "company_domain": "fitt.co",
      "ats_provider": "ashby",
      "job_title": "Global Supply Chain Analyst ",
      "job_category": "general_marketing",
      "department": null,
      "location": null,
      "job_description": "<p style=\"min-height:1.5em\">Fitt Talent Partners is a specialized recruitment firm working with top health and wellness companies.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We’re filling this role for a client, a premier global training brand.</p><p style=\"min-height:1.5em\"></p><h2><strong>Job Description</strong></h2><p style=\"min-height:1.5em\">We are seeking a detail-oriented and proactive Global Supply Chain Analyst to<br />join our Supply Chain team. This key role is responsible for supporting our global supply chain operations, focusing on international logistics, inventory transit, and coordination with third-party logistics providers (3PLs). The ideal candidate will be based in Delray Beach, FL, and will report directly to the Global Supply Chain and Inventory Manager.</p><p style=\"min-height:1.5em\"></p><h2><strong>Responsibilities</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate logistics activities with our suppliers and international 3PL partners to ensure timely and efficient management of purchase orders.</p></li><li><p style=\"min-height:1.5em\">Coordinate and manage logistics for outbound international shipments and inventory transit across global markets.</p></li><li><p style=\"min-height:1.5em\">Monitor and report on inventory levels, transit statuses, and logistics performance metrics.</p></li><li><p style=\"min-height:1.5em\">Assist in optimizing global supply chain processes to improve efficiency and reduce costs.</p></li><li><p style=\"min-height:1.5em\">Maintain accurate documentation and compliance for international shipments, inbound and outbound transit.</p></li><li><p style=\"min-height:1.5em\">Provide regular KPI updates and maintain supply chain databases.</p></li><li><p style=\"min-height:1.5em\">Support continuous improvement initiatives within the supply chain team.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Qualifications</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor’s degree in Supply Chain Management, Logistics, Business, or related field preferred.</p></li><li><p style=\"min-height:1.5em\">Proven experience in global supply chain, logistics, or inventory management.</p></li><li><p style=\"min-height:1.5em\">Strong understanding of international shipping, customs, and transit regulations.</p></li><li><p style=\"min-height:1.5em\">Excellent coordination and communication skills, with a focus on international partners.</p></li><li><p style=\"min-height:1.5em\">Ability to analyze data and generate actionable insights. </p></li><li><p style=\"min-height:1.5em\">Proficient in NetSuite or comparable ERP, WMS software, Microsoft Excel and</p></li></ul>",
      "job_url": "https://jobs.ashbyhq.com/fitt/a7e6adda-bdf1-4db0-9227-1ee1ccc99cd4",
      "posting_date": null,
      "discovered_at": "2026-01-23T11:55:05.105296",
      "relevance_score": 61.333333333333336,
      "is_active": 1,
      "is_new": false,
      "is_removed": false
    }
  ],
  "exported_at": "2026-01-23T11:57:06.339162"
}